#№1

a = 15 * 3
b = 15 / 3
c = 15 // 2
d = 15 ** 2
print(type(a))
print(type(b))
print(type(c))
print(type(d))


#№2
#---------------------------------------------------------------------------------

my_list = ['в', '5', 'часов', '17', 'минут', 'температура', 'воздуха', 'была', '+5', 'градусов']
result_list = []
for n in my_list:
    if n.isdigit(): result_list.append('"'), result_list.append(f"{int(n) :02}"), result_list.append('"')
    elif n.startswith('+'):result_list.append(f'"{n[0]}{int(n[1:]):02d}"')
    else: result_list.append(n)
n_2=' '.join(result_list)
print(n_2)




#№4-------------------------------------------------------------------------------------------


text = ['инженер-конструктор Игорь', 'главный бухгалтер МАРИНА', 'токарь высшего разряда нИКОЛАй', 'директор аэлита']

for a in text
print(f"Привет,{a.split()[-1].title()}!")




#№5----------------------------------------------------------------------------------

prices = [55.04, 22.05, 44.22, 55, 43, 66.32, 67.53, 22, 56.64, 11,
          22.44, 66, 44, 11.06, 6, 42, 99.99, 56.44, 14.44, 76.32,
          11.22, 77, 44, 33, 22.44, 56, 42.22, 68, 44.33, 55.32]

print(f"{'*' * 35 }")

for a in prices:
    rub, kop = str(f"{a:2f}").split(".")
    print(f"{rub} руб {int(kop):02d} коп,", end=" ")